# 定数定義

RAILS_ROOT = '/home/hiromu/rails/projects/gangvote/'


POSITIONS = {
  0 => '未使用',
  1 => 'OL',
  2 => 'TE',
  3 => 'QB',
  4 => 'RB'
}
POSITIONS_FORM = {
  'OL'     => 1,
  'TE'     => 2,
  'QB'     => 3,
  'RB'     => 4
}

GRADES = {
  0 => '未使用',
  1 => '1年',
  2 => '2年',
  3 => '3年',
  4 => '4年'
}

GRADES_FORM = {
  '1年'    => 1,
  '2年'    => 2,
  '3年'    => 3,
  '4年'    => 4
}

REGION = {
  0 => '未使用',
  1 => '北海道',
  2 => '青森',
  3 => '岩手',
  4 => '宮城',
  5 => '秋田',
  6 => '山形',
  7 => '福島',
  8 => '茨城',
  9 => '栃木',
  10 => '群馬',
  11 => '埼玉'
}

REGION_FORM = {
  '北海道' => 1,
  '青森'   => 2,
  '岩手'   => 3,
  '宮城'   => 4,
  '秋田'   => 5,
  '山形'   => 6,
  '福島'   => 7,
  '茨城'   => 8,
  '栃木'   => 9,
  '群馬'   => 10,
  '埼玉'   => 11
}

TEAMS_FORM = {
  'gangsters' => 'gangsters',
  'wildrover' => 'wildrover'
}

STADIUMS = {
  0 => '未使用',
  1 => '京都大学農学部グラウンド',
  2 => '同志社大学田辺キャンパス'
}

STADIUMS_FORM = {
  '京都大学農学部グラウンド' => 1,
  '同志社大学田辺キャンパス' => 2
}

IMG_EXTENTION = '.jpg'
