# 定数定義

RAILS_ROOT = '/home/hiromu/rails/projects/gangvote/'
BASE_URL   = 'http://gang-web.mobi/'

MAX_VOTE_TIME = 4
COOKIE_EXPIRE_HOUR = 10
STAR_COMPRESS_NUM = 20

POSITIONS = {
  0 => '未使用',
  1 => 'OL',
  2 => 'TE',
  3 => 'QB',
  4 => 'RB',
  5 => 'WR',
  6 => 'DL',
  7 => 'LB',
  8 => 'DB',
  9 => 'K/P',
  10 => 'LS',
  11 => 'H'
}
POSITIONS_FORM = {
  'OL'  => 1,
  'TE'  => 2,
  'QB'  => 3,
  'RB'  => 4,
  'WR'  => 5, 
  'DL'  => 6,
  'LB'  => 7,
  'DB'  => 8,
  'K/P' => 9,
  'LS' => 10,
  'H' => 11
}

GRADES = {
  0 => '未使用',
  1 => '1年',
  2 => '2年',
  3 => '3年',
  4 => '4年'
}

GRADES_FORM = {
  '1年'    => 1,
  '2年'    => 2,
  '3年'    => 3,
  '4年'    => 4
}

REGION = {
  0 => '未使用',
  1 => '北海道',
  2 => '青森',
  3 => '岩手',
  4 => '宮城',
  5 => '秋田',
  6 => '山形',
  7 => '福島',
  8 => '茨城',
  9 => '栃木',
  10 => '群馬',
  11 => '埼玉',
  12 => '千葉',
  13 => '東京',
  14 => '神奈川',
  15 => '新潟',
  16 => '富山',
  17 => '石川',
  18 => '福井',
  19 => '山梨',
  20 => '長野',
  21 => '岐阜',
  22 => '静岡',
  23 => '愛知',
  24 => '三重',
  25 => '滋賀',
  26 => '京都',
  27 => '大阪',
  28 => '兵庫',
  29 => '奈良',
  30 => '和歌山',
  31 => '鳥取',
  32 => '島根',
  33 => '岡山',
  34 => '広島',
  35 => '山口',
  36 => '徳島',
  37 => '香川',
  38 => '愛媛',
  39 => '高知',
  40 => '福岡',
  41 => '佐賀',
  42 => '長崎',
  43 => '熊本',
  44 => '大分',
  45 => '宮崎',
  46 => '鹿児島',
  47 => '沖縄'
}

REGION_FORM = {
  '北海道' => 1,
  '青森'   => 2,
  '岩手'   => 3,
  '宮城'   => 4,
  '秋田'   => 5,
  '山形'   => 6,
  '福島'   => 7,
  '茨城'   => 8,
  '栃木'   => 9,
  '群馬'   => 10,
  '埼玉'   => 11,
  '千葉'   => 12,
  '東京'   => 13,
  '神奈川' => 14,
  '新潟'   => 15,
  '富山'   => 16,
  '石川'   => 17,
  '福井'   => 18,
  '山梨'   => 19,
  '長野'   => 20,
  '岐阜'   => 21,
  '静岡'   => 22,
  '愛知'   => 23,
  '三重'   => 24,
  '滋賀'   => 25,
  '京都'   => 26,
  '大阪'   => 27,
  '兵庫'   => 28,
  '奈良'   => 29,
  '和歌山' => 30,
  '鳥取'   => 31,
  '島根'   => 32,
  '岡山'   => 33,
  '広島'   => 34,
  '山口'   => 35,
  '徳島'   => 36,
  '香川'   => 37,
  '愛媛'   => 38,
  '高知'   => 39,
  '福岡'   => 40,
  '佐賀'   => 41,
  '長崎'   => 42,
  '熊本'   => 43,
  '大分'   => 44,
  '宮崎'   => 45,
  '鹿児島' => 46,
  '沖縄'   => 47
}


TEAMS_FORM = {
  'gangsters' => 'gangsters',
  'wildrover' => 'wildrover',
  'raccoons'  => 'raccoons'
}
FACEBOOK_PAGES = {
  'gangsters' => 'https://www.facebook.com/pages/%E4%BA%AC%E9%83%BD%E5%A4%A7%E5%AD%A6%E3%82%A2%E3%83%A1%E3%83%AA%E3%82%AB%E3%83%B3%E3%83%95%E3%83%83%E3%83%88%E3%83%9C%E3%83%BC%E3%83%AB%E9%83%A8%E3%82%AE%E3%83%A3%E3%83%B3%E3%82%B0%E3%82%B9%E3%82%BF%E3%83%BC%E3%82%BA/123221844424464',
  'wildrover' => 'https://www.facebook.com/pages/%E5%90%8C%E5%BF%97%E7%A4%BE%E5%A4%A7%E5%AD%A6%E4%BD%93%E8%82%B2%E4%BC%9A%E3%82%A2%E3%83%A1%E3%83%AA%E3%82%AB%E3%83%B3%E3%83%95%E3%83%83%E3%83%88%E3%83%9C%E3%83%BC%E3%83%AB%E9%83%A8WILDROVER/185994394779508'
}

STADIUMS = {
  0 => '未使用',
  1 => '京都大学農学部グラウンド',
  2 => '同志社大学田辺キャンパス'
}

STADIUMS_FORM = {
  '京都大学農学部グラウンド' => 1,
  '同志社大学田辺キャンパス' => 2
}

#IMG_EXTENTION = 'gif'
IMG_EXTENTION = 'jpg'
